{
  "pchem_nodes": [
    {
      "id": "initial",
      "text": "Welcome to a choose-your-own-adventure game made by Carl, where you get to have fun (hopefully) and also learn some chemistry along the way (also hopefully)!\n--\nThis game is interactive; type your response in the box below and hit the \"Enter\" key.\n--\nIf you wish to skip the typing animation, hit the 'Enter' key again.\n--\nIf you wish to restart at any time, reload the page.\n--\nSometimes, you will be asked a question with multiple choices given; to respond, input the number next to your desired choice. For example, if the options are '1. banana, 2. apple, 3. orange' and you would like to answer 'banana', type '1'.\n--\nIf you are asked to respond with a word/phrase, make sure it is lowercase and spelled correctly. If you are typing a long response, capitalize as you please.\n--\nIf at any point you wish to see a list of commands or how to format your answer, type 'help'.\n--\nTyping 'outline' will generate an outline of content; you can skip to the section you wish.\n--\nIf you wish to take back your answer, type 'undo'. Note that this works only for the previous answer; you cannot undo more than that (as of right now).\n--\nThe game will display previous prompts for your reference. If you wish to print it out, just hit Ctrl+P or Cmd+P (for Mac).\n--\nYou can find the GitHub repository for this app at <a href=\"https://github.com/OrigamiKoala/chem-text-adventure\">https://github.com/OrigamiKoala/chem-text-adventure</a>\n--\nType anything to start from the beginning.",
      "type": "fr",
      "next": "atomscover",
      "correct": null,
      "op1": null,
      "op2": null,
      "op3": null,
      "op4": null
    },
    {
      "id": "end",
      "text": "And that is where the story ends...for now. Check back in a couple days and there might be something new :)\n--\nCheck out GitHub repository for this app at <a href=\"https://github.com/OrigamiKoala/chem-text-adventure\">https://github.com/OrigamiKoala/chem-text-adventure</a>\n--\nInterested in chemistry? Check out:\n<ul>\n<li><i>Cartoon Guide to Chemistry</i></li>\n<li>Khan Academy's Chemistry courses</li>\n<li><i>Chemistry</i> by Steven S. Zumdahl</li>\n<li><i>Chemical Principles</i> by Steven S. Zumdahl</li>\n<li><i>Atkins' Chemical Principles</i> by Peter Atkins</li>\n<li><i>Atkins' Physical Chemistry</i> by Peter Atkins</li>\n<li><i>Inorganic Chemistry</i> by Gary L. Miessler</li>\n<li><i>Organic Chemistry</i> by David Klein</li>\n<li><i>Organic Chemistry</i> by Jonathan Clayden</li>\n</ul>\n--\nIt would be greatly appreciated if you could take a minute to fill out a super short <a href=\"http://bit.ly/chemcyoafeedback\">feedback form</a>. Thank you so much!",
      "type": "fr",
      "next": null,
      "correct": null,
      "op1": null,
      "op2": null,
      "op3": null,
      "op4": null
    },
    {
      "id": "error",
      "text": "Sorry, that section does not exist yet.",
      "type": null,
      "next": null,
      "correct": null,
      "op1": null,
      "op2": null,
      "op3": null,
      "op4": null
    },
    {
      "id": "atomscover",
      "text": "<h1>Section 1: Atoms and Molecules</h1>\n--\n<h3>History of the Atom</h3>\n--\nA long long time ago, some ancient Greek dudes asked a very interesting question: Could you keep on slicing something into smaller pieces forever?\n--\nWhat do you think?\n--\n<ol type = \"1\">\n<li>Yes, definitely!</li>\n<li>Uhh....no</li>\n</ol>",
      "type": "mcq",
      "next": null,
      "correct": null,
      "op1": "divisiblepaper",
      "op2": "elements",
      "op3": null,
      "op4": null
    },
    {
      "id": "elements",
      "text": "Some Greeks thought the answer was \"yes\", but one guy, Democritus, agreed with you. He decided at some point, you would reach the smallest thing in the universe that couldn't be split further. He called this atomos, meaning \"indivisible\". Later, scientists would call these super small particles \"atoms\".\n--\nBut these were ancient Greeks, and they didn't yet have the tools to do fancy experiments to figure out the truth. So they kind of just forgot about atoms and agreed that all of matter was made of four elements: earth, air, fire, and water (hence Avatar). What's your favorite element?\n--\n<ol type=\"1\">\n<li>Earth</li>\n<li>Air</li>\n<li>Fire</li>\n<li>Water</li>\n</ol>",
      "type": "fr",
      "next": "alchemy",
      "correct": null,
      "op1": null,
      "op2": null,
      "op3": null,
      "op4": null
    },
    {
      "id": "alchemy",
      "text": "Nice choice :)\n--\nWell, skip a couple centuries and along come the alchemists! These were people who believed in the idea of four elements. Three of their most famous goals were to make a panacea (something that could cure all diseases), find or make an elixir of immortality (that could ensure they lived forever), and turn any metal into gold (for more info see <a href=\"https://en.wikipedia.org/wiki/Alchemy\">here</a>). \n--\nHistory kind of portrayed alchemists as superstitious crackpots who had no idea what they were doing, and were super greedy.\n--\nI don't know how accurate that is, given that Isaac Newton (the guy who introduced the idea of gravity) was also an alchemist...\n--\nBut the alchemists did something very important... they wrote down what they did!\n--\nIn fact, they wrote down a lot of data and observations that they collected from their experiments, and these notebooks would later be pretty useful for later chemists. Do you write stuff down?\n<ol type=\"1\">\n<li>Absolutely!</li>\n<li>Nope</li>\n</ol>",
      "type": "mcq",
      "next": null,
      "correct": null,
      "op1": "studyhabits",
      "op2": "takenotes",
      "op3": null,
      "op4": null
    },
    {
      "id": "divisiblepaper",
      "text": "A lot of Greeks agreed with you.\n--\nTry this out: Grab a piece of paper and tear it into two pieces.\n--\nThen tear each piece into two more pieces.\n--\nThen repeat.\n--\n(please actually give it a try; tearing up paper is oddly satisfying)\n--\nCould you keep on going forever?",
      "type": "fr",
      "next": "hypothesis",
      "correct": null,
      "op1": null,
      "op2": null,
      "op3": null,
      "op4": null
    },
    {
      "id": "hypothesis",
      "text": "Wow! Look at that! You made a hypothesis, which is basically an answer to a question you are asking. Science revolves around making hypotheses, and then using experiments to back your ideas up (or prove them wrong)\n--\nWell, how many pieces did you end up with?",
      "type": "fr",
      "next": "explainpaperlab",
      "correct": null,
      "op1": null,
      "op2": null,
      "op3": null,
      "op4": null
    },
    {
      "id": "explainpaperlab",
      "text": "That's a lot of pieces! I certainly didn't end up with that many pieces when I tried!\n--\nWell, it looks like our idea that things could be divided forever wasn't exactly true...but that's okay! Science is filled with wrong ideas, and today scientists still aren't really sure if all their ideas are right.\n--\nWhy do you think you couldn't keep on going after a certain point?",
      "type": "fr",
      "next": "paperlabresult",
      "correct": null,
      "op1": null,
      "op2": null,
      "op3": null,
      "op4": null
    },
    {
      "id": "paperlabresult",
      "text": "Good idea. Well, now what do you think? Can you forever divide something into smaller pieces?\n<ol type=\"1\">\n<li>Definitely</li>\n<li>Nope</li>\n</ol>",
      "type": "mcq",
      "next": null,
      "correct": null,
      "op1": "divisiblepaper",
      "op2": "elements",
      "op3": null,
      "op4": null
    },
    {
      "id": "studyhabits",
      "text": "Well, good job! You have great habits! Just curious: what app do you use?",
      "type": "fr",
      "next": "studyhabitsvalidation",
      "correct": null,
      "op1": null,
      "op2": null,
      "op3": null,
      "op4": null
    },
    {
      "id": "takenotes",
      "text": "Hmmm...that's okay. I would suggest writing stuff down though - it could come useful in the future. Also, it builds good habits for a scientist. \n--\nType anything to continue.",
      "type": "fr",
      "next": "dalton",
      "correct": null,
      "op1": null,
      "op2": null,
      "op3": null,
      "op4": null
    },
    {
      "id": "studyhabitsvalidation",
      "text": "Nice app! I might give it a try.\n--\nType anything to continue.",
      "type": "fr",
      "next": "dalton",
      "correct": null,
      "op1": null,
      "op2": null,
      "op3": null,
      "op4": null
    },
    {
      "id": "dalton",
      "text": "Well anyway, mankind kind of forgot about atoms until the 18th century, when a lot of questions about matter surfaced. One of the important guys was John Dalton, who decided Democritus was probably right about atomos. He called these tiny particles \"atoms\".\n--\nAs it turns out, however, atoms are not actually indivisible - there are smaller particles. For the smallest particles known to mankind, search up \"standard model of particle physics\". Domain of Science has a great <a href=\"https://www.youtube.com/watch?v=mYcLuWHzfmE\">YouTube video</a> on this. TED-ED <a href=\"https://www.youtube.com/watch?v=ehHoOYqAT_U\">does too!</a>\n--\nType anything to continue",
      "type": "fr",
      "next": "magnets",
      "correct": null,
      "op1": null,
      "op2": null,
      "op3": null,
      "op4": null
    },
    {
      "id": "magnets",
      "text": "<h3>Atomic Structure</h3>\n--\nYou know about <a href=\"https://science.howstuffworks.com/magnet.htm\">magnets</a>, right? They have a North pole and a South pole. One of them is positively charged, and the other is negatively charged. Do you know which one is which? (It's okay if you don't; I didn't either until I searched it up)\n--\n<ol type = \"1\">\n<li>North is positive, South is negative</li>\n<li>South is positive, North is negative</li>\n<li>I don't know</li>",
      "type": "mcq",
      "next": null,
      "correct": null,
      "op1": "northpos",
      "op2": "southpos",
      "op3": "idkpos",
      "op4": null
    },
    {
      "id": "northpos",
      "text": "Nice job! I didn't know this, but apparently the north pole is generally considered the positive end? Which is funny, because Earth's \"North Pole\" (the one with Santa) is actually negative...and Earth actually has two North Poles...and the North and South Pole flip every couple thousand years...(see <a href=\"https://worldoceanreview.com/en/wor-6/the-arctic-and-antarctic-natural-realms-at-the-poles/a-brief-history-of-the-polar-regions/the-earths-wandering-poles/\">here</a>\n--\nThe real world is so confusing.\n--\nType anything to continue.",
      "type": "fr",
      "next": "attraction",
      "correct": null,
      "op1": null,
      "op2": null,
      "op3": null,
      "op4": null
    },
    {
      "id": "southpos",
      "text": "You're actually half right. Turns out the Earth's \"South Pole\" is positive. But it's generally accepted that for most magnets, the north pole is the positive end, and the south pole is the negative end. See more about the Earth's wacky four different poles <a href=\"https://worldoceanreview.com/en/wor-6/the-arctic-and-antarctic-natural-realms-at-the-poles/a-brief-history-of-the-polar-regions/the-earths-wandering-poles/\">here</a>.\n--\nBut hey, I didn't know the North was positive either, at least until I searched it up.\n--\nType anything to continue.",
      "type": "fr",
      "next": "attraction",
      "correct": null,
      "op1": null,
      "op2": null,
      "op3": null,
      "op4": null
    },
    {
      "id": "idkpos",
      "text": "That's ok! I didn't know either until I searched it up. It's good that you aren't randomly guessing - for this game, guessing is fine, but in real world science, try not to guess too much :)\n--\nTurns out the north pole of a magnet is the positive end, and the south pole is the negative end. But for this planet we live on, it's actually the opposite - our \"North Pole\" (the one with Santa) is negative...but the poles switch every couple thousand years... (see <a href=\"https://worldoceanreview.com/en/wor-6/the-arctic-and-antarctic-natural-realms-at-the-poles/a-brief-history-of-the-polar-regions/the-earths-wandering-poles/\">here</a>)\n--\nNot at all confusing...\n--\nType anything to continue",
      "type": "fr",
      "next": "attraction",
      "correct": null,
      "op1": null,
      "op2": null,
      "op3": null,
      "op4": null
    },
    {
      "id": "attraction",
      "text": "The positive end of one magnet attracts the negative end of another magnet. I know that's confusing, but hey, I didn't make up the laws of physics :)\n--\nAs a result of the positive ends and negative ends being attracted, the positive end snaps to the negative end if you bring them close enough. If you want, now is the time to grab some magnets and try this out. This is also oddly satisfying.\n--\nType anything to continue.",
      "type": "fr",
      "next": "atompos",
      "correct": null,
      "op1": null,
      "op2": null,
      "op3": null,
      "op4": null
    },
    {
      "id": "atompos",
      "text": "Enough about magnets.\n--\nAtoms are kind of like tiny magnets - they have positive parts, and negative parts. The positive parts are called protons, and the negative parts are called electrons. You can imagine them as tiny little specks or balls (particles).\n--\nThe protons are all bundled together in the center, called the nucleus, and the electrons orbit around the nucleus.\n--\nFor magnets, pushing two ends with the same charge (positive or negative) is extremely difficult, and requires lots of energy. So do you think the nucleus contains a lot of energy?\n--\n<ol type = \"1\">\n<li>Yep</li>\n<li>Nope</li>\n</ol>",
      "type": "mcq",
      "next": null,
      "correct": null,
      "op1": "nucleushighenergy",
      "op2": "nucleuslowenergy",
      "op3": null,
      "op4": null
    },
    {
      "id": "nucleushighenergy",
      "text": "That's right! Since the nucleus contains a whole bunch of positive particles, a lot of energy must be used to keep the nucleus together.\n--\nIf you've ever heard of nuclear bombs or nuclear energy, they are essentially processes that split the nuclei (plural of nucleus) of atoms. That means the protons are separated.\n--\nNuclear bombs and nuclear power plants release a lot of energy. Why do you think this is the case?",
      "type": "fr",
      "next": "explanationnucleuslowenergy",
      "correct": null,
      "op1": null,
      "op2": null,
      "op3": null,
      "op4": null
    },
    {
      "id": "nucleuslowenergy",
      "text": "Why do you think the nucleus is low energy?",
      "type": "fr",
      "next": "explanationnucleuslowenergy",
      "correct": null,
      "op1": null,
      "op2": null,
      "op3": null,
      "op4": null
    },
    {
      "id": "explanationnucleuslowenergy",
      "text": "Well, even though an atom is pretty stable, the nucleus is actually super high energy, since the protons are packed so close together.\n--\nIn order for the protons (which are all positive) to be so close, there must be a lot of energy used to hold the nucleus together, so the nucleus is pretty high in energy.\n--\nIf you've ever heard of nuclear bombs or nuclear energy, they are essentially processes that split the nuclei (plural of nucleus) of atoms. That means the protons are separated.\n--\nNuclear bombs and nuclear power plants release a lot of energy. Why do you think this is the case?",
      "type": "fr",
      "next": "checkoutnuclear",
      "correct": null,
      "op1": null,
      "op2": null,
      "op3": null,
      "op4": null
    },
    {
      "id": "checkoutnuclear",
      "text": "They release energy because the nuclei split, so protons of the atoms aren't so tightly packed into the nuclei anymore. All the energy that once held the nucleus together is no longer needed, so it is released in one big BOOM! \n--\nThat's a pretty simplified version. For a more complicated version, check out the nuclear chemistry section, or google \"nuclear physics\". The Institute for Energy and Environmental Research has a good <a href=\"https://ieer.org/resource/factsheets/basics-nuclear-physics-fission/\">article</a> introducing nuclear physics, which is a whole field of science in itself.\n--\nType anything to continue.",
      "type": "fr",
      "next": "neutron",
      "correct": null,
      "op1": null,
      "op2": null,
      "op3": null,
      "op4": null
    },
    {
      "id": "neutron",
      "text": "There is also a third particle in the atom - the neutron, which has no charge. It isn't positive or negative, and it's found in the nucleus.\n--\nType anything to continue.",
      "type": "fr",
      "next": "legos",
      "correct": null,
      "op1": null,
      "op2": null,
      "op3": null,
      "op4": null
    },
    {
      "id": "legos",
      "text": "All atoms are made of protons, neutrons, and electrons - but with different amounts.\n--\nThe number of protons in an atom's nucleus determines its \"element\". Atoms are kind of like Legos - they come in different types.\n--\nThe number of protons and electrons determines how an atom behaves. Atoms with different numbers of protons and electrons behave differently, kind of like how Legos with different shapes fit together differently and are used for different things.\n--\nWe have a table of all the different elements - called the \"Periodic Table of the Elements\" or just the \"Periodic Table\". \n<br><img src = \"https://www.nist.gov/sites/default/files/styles/social/public/images/2024/06/25/NIST_periodictable_June24_iupac_Page_1.png?itok=odSH_Vgc\" alt=\"Periodic Table\">\n--\nFun fact: there is also a periodic table of legos: \n<br><img src = \"https://images.brickset.com/news/99007_P1078365.JPG\" alt = \"Periodic Table of Lego Colors\">\n--\nType anything to continue.",
      "type": "fr",
      "next": "isotopes",
      "correct": null,
      "op1": null,
      "op2": null,
      "op3": null,
      "op4": null
    },
    {
      "id": "isotopes",
      "text": "<h3>Isotopes and Atomic Mass</h3>\n--\nAtoms with the same number of protons but <i>different</i> numbers of neutrons are called <i>isotopes</i>. They pretty much behave the same, but look different - like how different Legos with the same shape but different color behave the same, but look different.\n--\nType anything to continue.",
      "type": "fr",
      "next": null,
      "correct": null,
      "op1": null,
      "op2": null,
      "op3": null,
      "op4": null
    }
  ],
  "active_pchem_outline": [
    {
      "reference_num": 1,
      "content": "Atoms and Molecules",
      "div": "atomscover"
    },
    {
      "reference_num": 1.1,
      "content": "History of the Atom",
      "div": "atomscover"
    },
    {
      "reference_num": 1.2,
      "content": "Atomic Structure",
      "div": "magnets"
    },
    {
      "reference_num": 1.3,
      "content": "Isotopes and Atomic Mass",
      "div": "isotopes"
    },
    {
      "reference_num": 1.4,
      "content": "Molecular Formulas",
      "div": "error"
    },
    {
      "reference_num": 1.5,
      "content": "Percent Composition",
      "div": "error"
    }
  ]
}